app/controllers/pages_controller.rb

SELECT "sneakers".* FROM "sneakers"
---
  def index
    @sneakers = Sneaker.all