app/controllers/sneakers_controller.rb

SELECT "sneakers".* FROM "sneakers"
---
  def index
    @sneakers = Sneaker.all

SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 122], ["LIMIT", 1]]
---
  def show
    if Sneaker.exists?(params[:id])
      @sneaker = Sneaker.find(params[:id])

INSERT INTO "sneakers" ("created_at", "updated_at", "name", "sku", "description", "drop_date", "estimated_ressell", "ressell_circle", "brand", "model", "retail") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @sneaker = Sneaker.new(sneaker_params)
    if @sneaker.save!